src/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РуководительПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДелегированныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резервы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗапрещенныеОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗапрещенныеСклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗапрещенныеКонтрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеРегионы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл) Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЗаказаПоставщиком</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКОПФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаККонтрагенту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбАфиллирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбКоммерческий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбЛаборатория</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбДилер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбДистрибютер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбКонечник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбСрокЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбСуммаЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбОтгрузкаЗапрещена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>амбКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерыПокупателя</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МенеджерПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Елисеев/Ext/Module.bsl
//Модуль процедур - доработок.
 
 Функция ИспользоватьКонтрольПрав()
	//Настройка использования контроля 
	//Истина - итспользовать, ложь - не использовать.
	 Возврат Истина;
	 
 КонецФункции	 
 
 ////////////////////////////////////////////////////
 //Проверка прав пользователя.
 
 //Есть ли у суперпользователя права суперпользователя 
 Функция ЭтоСуперпользователь() Экспорт
	 
	 Если РольДоступна("Суперпользователь") тогда 
		 Возврат Истина;
	 Иначе	 
	     Возврат Ложь;
	 КонецЕсли;	 
		 
 КонецФункции	
 //Есть ли у пользователя права админа
 Функция ЭтоАдмин() Экспорт
	 
	 Если РольДоступна("ПолныеПрава") тогда 
		 Возврат Истина;
	 Иначе	 
	     Возврат Ложь;
	 КонецЕсли;	  
	 
 КонецФункции	 
 //Есть ли у сотрудника права администратора склада
  Функция ЭтоАдминистраторСклада() Экспорт
	 
	 Если РольДоступна("АдминистраторСклада") тогда 
		 Возврат Истина;
	 Иначе	 
	     Возврат Ложь;
	 КонецЕсли;	  
	 
 КонецФункции	
 
 //Является ли текущийПользователь руководителем  подразделения выбранного сотрудника
 Функция ЭтоРуководительПодразделения(Сотрудник) Экспорт
	 
	 Запрос = Новый Запрос;
		 Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                |	Подразделения.Ссылка
		                |ИЗ
		                |	Справочник.Подразделения КАК Подразделения
		                |ГДЕ
		                |	Подразделения.РуководительПодразделения = &РуководительПодразделения
		                |	И Подразделения.Сотрудники.Пользователь = &ПроверяемыйСотрудник";
		 
		 Запрос.УстановитьПараметр("РуководительПодразделения", ПараметрыСеанса.ТекущийПользователь );
		 Запрос.УстановитьПараметр("ПроверяемыйСотрудник", Сотрудник );

		 
		 Результат = Запрос.Выполнить();
		 Выборка = Результат.Выбрать();
		 
		 Если  Выборка.Количество()> 0 Тогда
			 Возврат Истина;
		 Иначе
			 Возврат Ложь;
		 КонецЕсли;	 
	 
 КонецФункции
 
 //Список подразделений, в которых работает сотрудник
 Функция ПолучитьПодразделения(Сотрудник)Экспорт
	    Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодразделенияСотрудники.Ссылка
		               |ИЗ
		               |	Справочник.Подразделения.Сотрудники КАК ПодразделенияСотрудники
		               |ГДЕ
		               |	(ПодразделенияСотрудники.Пользователь = &Пользователь
		               |			ИЛИ ПодразделенияСотрудники.Ссылка.РуководительПодразделения = &Пользователь)";
		
		Запрос.УстановитьПараметр("Пользователь", Сотрудник );    		
		Результат = Запрос.Выполнить();                           		
		Возврат Результат.Выгрузить();		
		
 КонецФункции	                                 
 
 //Отображает сотрудников подразделения
 Функция СотрудникиПодразделений(Подразделения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПодразделенияСотрудники.Пользователь
	               |ИЗ
	               |	Справочник.Подразделения.Сотрудники КАК ПодразделенияСотрудники
	               |ГДЕ
	               |	ПодразделенияСотрудники.Ссылка В(&Подразделения)"	;
	 
	Запрос.УстановитьПараметр("Подразделения", Подразделения );		
	Результат = Запрос.Выполнить();		
	Возврат Результат.Выгрузить();	 
	 
 КонецФункции	 
 
 //Список сотрудников, доверяющих просмотр
 Функция ПолучитьДоверителейНаПросмотр(Сотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПользователиДелегированныеЛица.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи.ДелегированныеЛица КАК ПользователиДелегированныеЛица
	               |ГДЕ
	               |	ПользователиДелегированныеЛица.Пользователь = &Пользователь
	               |	И ПользователиДелегированныеЛица.Чтение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь",Сотрудник );
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	  
 КонецФункции
 
 //Список сотрудников, доверяющих редактирование
 Функция ПолучитьДоверителейНаРедактирование(Сотрудник) Экспорт
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПользователиДелегированныеЛица.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи.ДелегированныеЛица КАК ПользователиДелегированныеЛица
	               |ГДЕ
	               |	ПользователиДелегированныеЛица.Пользователь = &Пользователь
	               |	И ПользователиДелегированныеЛица.Запись = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь",Сотрудник );
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
 
 КонецФункции
 
 //Список сотрудников, доверяющих управление резервами
 Функция ПолучитьДоверителейНаРезервирование(Сотрудник) Экспорт
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПользователиДелегированныеЛица.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи.ДелегированныеЛица КАК ПользователиДелегированныеЛица
	               |ГДЕ
	               |	ПользователиДелегированныеЛица.Пользователь = &Пользователь
	               |	И ПользователиДелегированныеЛица.Резервы = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь",Сотрудник );
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
 
 КонецФункции	 
 
 //Можно ли открывать организацию?
 Функция ОрганизацияРазрешена(Сотрудник, Организация) Экспорт
	 
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	ПользователиЗапрещенныеОрганизации.Ссылка
	                  |ИЗ
	                  |	Справочник.Пользователи.ЗапрещенныеОрганизации КАК ПользователиЗапрещенныеОрганизации
	                  |ГДЕ
	                  |	ПользователиЗапрещенныеОрганизации.Ссылка = &Пользователь
	                  |	И ПользователиЗапрещенныеОрганизации.Организация = &Организация";
	   
	   Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	   Запрос.УстановитьПараметр("Организация",  Организация);
	   
	   Результат = Запрос.Выполнить();
	   Выборка = Результат.Выбрать();
	   
	   Если Выборка.Количество()>0 тогда
		   Возврат Ложь;
	   Иначе
		   Возврат Истина;
	   КонецЕсли;	   
 
 КонецФункции	 
 
 //Можно ли использовать склад?
 Функция СкладРазрешен(Сотрудник, Склад) Экспорт
	    Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ПользователиЗапрещенныеСклады.Ссылка
	                  |ИЗ
	                  |	Справочник.Пользователи.ЗапрещенныеСклады КАК ПользователиЗапрещенныеСклады
	                  |ГДЕ
	                  |	ПользователиЗапрещенныеСклады.Ссылка = &Пользователь
	                  |	И ПользователиЗапрещенныеСклады.Склад = &Склад";
	   
	   Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	   Запрос.УстановитьПараметр("Склад",  Склад);
	   
	   Результат = Запрос.Выполнить();
	   Выборка = Результат.Выбрать();
	   
	   Если Выборка.Количество()>0 тогда
		   Возврат Ложь;
	   Иначе
		   Возврат Истина;
	   КонецЕсли;	   

 КонецФункции	 
 
 //Контрагент разрешен?
 Функция КонтрагентРазрешен(Сотрудник, Контрагент) Экспорт
	 
	 Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ПользователиЗапрещенныеКонтрагенты.Ссылка
	                  |ИЗ
	                  |	Справочник.Пользователи.ЗапрещенныеКонтрагенты КАК ПользователиЗапрещенныеКонтрагенты
	                  |ГДЕ
	                  |	ПользователиЗапрещенныеКонтрагенты.Ссылка = &Пользователь
	                  |	И ПользователиЗапрещенныеКонтрагенты.Контрагент = &Контрагент";
	   
	   Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	   Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	   
	   Результат = Запрос.Выполнить();
	   Выборка = Результат.Выбрать();
	   
	   Если Выборка.Количество()>0 тогда
		   Возврат Ложь;
	   Иначе
		   Возврат Истина;
	   КонецЕсли;	   

 КонецФункции
 
 //Регион разрешен?
 Функция РегионРазрешен (Сотрудник, Регион) Экспорт
	 
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ПользователиРазрешенныеРегионы.Ссылка
	                  |ИЗ
	                  |	Справочник.Пользователи.РазрешенныеРегионы КАК ПользователиРазрешенныеРегионы
	                  |ГДЕ
	                  |	ПользователиРазрешенныеРегионы.Ссылка = &Пользователь
	                  |	И ПользователиРазрешенныеРегионы.Регион = &Регион";
	   
	   Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	   Запрос.УстановитьПараметр("Регион",  Регион);
	   
	   Результат = Запрос.Выполнить();
	   Выборка = Результат.Выбрать();
	   
	   Если Выборка.Количество()>0 тогда
		   Возврат Истина;
	   Иначе
		   Возврат Ложь;
	   КонецЕсли;	
   КонецФункции	
   
 Функция СотрудникДоверяетЧтениеДокументовТекПользователю(Сотрудник)
	   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиДелегированныеЛица.Ссылка
	|ИЗ
	|	Справочник.Пользователи.ДелегированныеЛица КАК ПользователиДелегированныеЛица
	|ГДЕ
	|	ПользователиДелегированныеЛица.Пользователь = &ТекущийПользователь
	|	И ПользователиДелегированныеЛица.Чтение = ИСТИНА
	|	И ПользователиДелегированныеЛица.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник );
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь );

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество()>0 Тогда
		Возврат Истина;
	иначе
		Возврат Ложь;
	КонецЕсли; 
	
 КонецФункции
 
//Возвращает список разроешенных регионов
Функция ПолучитьРегионыСотрудника(Сотрудник)
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПользователиРазрешенныеРегионы.Регион
	 |ИЗ
	 |	Справочник.Пользователи.РазрешенныеРегионы КАК ПользователиРазрешенныеРегионы
	 |ГДЕ
	 |	ПользователиРазрешенныеРегионы.Ссылка = &Сотрудник";
	 
	 Запрос.УстановитьПараметр("Сотрудник",Сотрудник );
	 
	 Возврат Запрос.Выполнить().Выгрузить();
		 
	
КонецФункции	  
  ///////////////////////////////////////////////////////////////////
  //Модули обработки ограничения прав////////////////////////////////
  ///////////////////////////////////////////////////////////////////

Процедура амбЗаказПриОткрытииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры


Функция МожноОткрытьЗаказ(СсылкаНаОбъект) Экспорт
//Проверка заказа покупателя на возможность быть открытым.
//Возвращает отказ = Истина/Ложь 

Если ИспользоватьКонтрольПрав() Тогда 
	Если ЕстьЗапретНаПросмотрКонтрагента(СсылкаНаОбъект.Контрагент) тогда
		Возврат Истина;	
	Иначе	
		Если СсылкаНаОбъект.ЭтоНовый() или ЭтоАдмин() или ЭтоСуперпользователь() тогда
			Возврат Истина;
		ИначеЕсли 	ПараметрыСеанса.ТекущийПользователь = СсылкаНаОбъект.Ответственный или ПараметрыСеанса.ТекущийПользователь = СсылкаНаОбъект.ДоговорКонтрагента.вббОтветственный тогда
			Возврат Истина;
		ИначеЕсли ЭтоРуководительПодразделения(СсылкаНаОбъект.Ответственный) или ЭтоРуководительПодразделения(СсылкаНаОбъект.ДоговорКонтрагента.вббОтветственный) тогда
			Возврат Истина;
		ИначеЕсли СотрудникДоверяетЧтениеДокументовТекПользователю(СсылкаНаОбъект.Ответственный) или СотрудникДоверяетЧтениеДокументовТекПользователю(СсылкаНаОбъект.ДоговорКонтрагента.вббОтветственный) тогда
	        Возврат Истина;		
		Иначе	
			Возврат Ложь;
		КонецЕсли;	//Это Админ?
	КонецЕсли; // Есть запрет на просмотр контрагента	
Иначе 
	Возврат Истина;
КонецЕсли; //Использовать контроль прав	

КонецФункции	

Функция ЕстьЗапретНаПросмотрКонтрагента(Контрагент) Экспорт     	
	Если ИспользоватьКонтрольПрав() тогда  		
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() или Контрагент.ЭтоНовый() или ЭтоАдмин() или ЭтоСуперпользователь() тогда
			Возврат Ложь;
		ИначеЕсли не РегионРазрешен (ПараметрыСеанса.ТекущийПользователь, Контрагент.Регион) Тогда			
			Возврат Истина;
		ИначеЕсли не КонтрагентРазрешен(ПараметрыСеанса.ТекущийПользователь, Контрагент) Тогда
			Возврат Истина; 
		Иначе
			Возврат Ложь;
		КонецЕсли	
	Иначе
		Возврат Ложь;
	КонецЕсли;//Использовать контроль прав?	
КонецФункции
